In [102]:
### Ejercicio 1
# 1) Crea una lista de nombre "Concursante" que contenga los siguientes valores:
# "Juan", "Pedro", "Andrea", "Luis", "Ana", "Lara", "Jose", "Estefania"

In [103]:
Concursantes = ["Juan", "Pedro", "Andrea", "Luis", "Ana", "Lara", "Jose", "Estefania"]

In [122]:
Concursantes

['Juan', 'Pedro', 'Andrea', 'Luis', 'Ana', 'Lara', 'Jose', 'Estefania']

In [123]:
# 2) Crea una lista de nombre "Resultados" que contenga los siguientes valores:
# 20, 30, 50, 20, 10, 5, 60, 40
Resultados = [20, 30, 50, 20, 10, 5, 60, 40]
Resultados

[20, 30, 50, 20, 10, 5, 60, 40]

In [124]:
# 3) Crea un diccionario con los concursantes y los resultados.
diccionario={"Concursantes": Concursantes, "Resultados":Resultados}
diccionario

{'Concursantes': ['Juan',
  'Pedro',
  'Andrea',
  'Luis',
  'Ana',
  'Lara',
  'Jose',
  'Estefania'],
 'Resultados': [20, 30, 50, 20, 10, 5, 60, 40]}

In [125]:
# 4) Crea un dataframe vacio y apendiza los concursantes y los resultados mediante el empleo de un bucle for
import pandas as pd

df = pd.DataFrame(columns=["Concursantes", "Resultados"])

In [126]:
df

Empty DataFrame
Columns: [Concursantes, Resultados]
Index: []

In [127]:
for key, value in diccionario.items():
    print(key,value)
    df[key]=value
df

Concursantes ['Juan', 'Pedro', 'Andrea', 'Luis', 'Ana', 'Lara', 'Jose', 'Estefania']
Resultados [20, 30, 50, 20, 10, 5, 60, 40]

  Concursantes  Resultados
0         Juan          20
1        Pedro          30
2       Andrea          50
3         Luis          20
4          Ana          10
5         Lara           5
6         Jose          60
7    Estefania          40

In [75]:
data2 = dict(zip(Concursantes, Resultados))

df2 = pd.DataFrame(columns=["Concursantes", "Resultados"])

list_keys = []
list_values = []

for key, value in data2.items():
    list_keys.append(key)
    list_values.append(value)

df2["Concursantes"] = list_keys
df2["Resultados"] = list_values
df2

  Concursantes  Resultados
0         Juan          20
1        Pedro          30
2       Andrea          50
3         Luis          20
4          Ana          10
5         Lara           5
6         Jose          60
7    Estefania          40

In [76]:
df3 = pd.DataFrame(columns=["Concursantes", "Resultados"])

df3["Concursantes"] = Concursantes
df3["Resultados"] = Resultados
df3

  Concursantes  Resultados
0         Juan          20
1        Pedro          30
2       Andrea          50
3         Luis          20
4          Ana          10
5         Lara           5
6         Jose          60
7    Estefania          40

In [68]:
# 5) Con ayuda de loc filtra los resultados obtenidos desde Pedro hasta Lara.
df.loc[1:5,:]

  Concursantes  Resultados
1        Pedro          30
2       Andrea          50
3         Luis          20
4          Ana          10
5         Lara           5

In [107]:
# 6) Con ayuda de loc filtra los resultados obtenidos mayores o iguales a 40
df[df["Resultados"]>=40]

  Concursantes  Resultados
2       Andrea        50.0
6         Jose        60.0
7    Estefania        40.0

In [109]:
# 7) Muestra el concursante con la mayor puntuación
df["Resultados"].max()

60.0

In [30]:
df.Resultados.max()

60

In [31]:
# 8) Muestra el concursante con la menor puntuación
df.Resultados.min()

5

In [32]:
df["Resultados"].min()

5

In [77]:
# 9) Modifica con la ayuda de loc los valores 20 por 0
df.loc[df["Resultados"]==20, "Resultados"]=0
df

  Concursantes  Resultados
0         Juan           0
1        Pedro          30
2       Andrea          50
3         Luis           0
4          Ana          10
5         Lara           5
6         Jose          60
7    Estefania          40

In [78]:
# 10) Modifica Concursante "Juan" su puntuación por "None" con ayuda de .loc
df.loc[df["Concursantes"]=="Juan", "Resultados"]=None
df

  Concursantes  Resultados
0         Juan         NaN
1        Pedro        30.0
2       Andrea        50.0
3         Luis         0.0
4          Ana        10.0
5         Lara         5.0
6         Jose        60.0
7    Estefania        40.0

In [80]:
# EJERCICIO 2 (3)
# 
# """
#     Escribe un programa que pida dos palabras y diga si riman o no.
#     Si coinciden las tres últimas letras tiene que decir que riman.
#     Si coinciden sólo las dos últimas tiene que decir que riman un poco y si no, que no riman.
# """

In [111]:
primera_palabra=input("Escriba primera palabra: ")
segunda_palabra=input("Escriba segunda palabra: ")

Escriba primera palabra: Jabon
Escriba segunda palabra: Jamon

In [116]:
primera_palabra
str.upper(primera_palabra)
primera_palabra

'Jabon'

In [83]:
primera_palabra[0]

'J'

In [84]:
primera_palabra[-1]

'n'

In [121]:
primera_palabra=str.upper(input("Escriba primera palabra: "))
segunda_palabra=str.upper(input("Escriba segunda palabra: "))

if (primera_palabra[-1]==segunda_palabra[-1]) and (primera_palabra[-2]==segunda_palabra[-2]) and (primera_palabra[-3]==segunda_palabra[-3]):
    print("Las palabra Riman")
elif (primera_palabra[-1]==segunda_palabra[-1]) and (primera_palabra[-2]==segunda_palabra[-2]):
    print("Las palabra Riman POCO")
else:
        print("Las palabra NO Riman")

Escriba primera palabra: jabon
Escriba segunda palabra: mamon
Las palabra Riman POCO

In [118]:
if (primera_palabra[-3:]==segunda_palabra[-3:]):
    print("Las palabras", primera_palabra, "y" ,segunda_palabra, "Riman")
elif (primera_palabra[-2:]==segunda_palabra[-2:]):
    print("Las palabras", primera_palabra, "y" ,segunda_palabra, "Riman POCO")
else:
    print("Las palabras", primera_palabra, "y" ,segunda_palabra, "NO Riman")

Las palabras Jabon y Jamon Riman POCO

In [98]:
primera_palabra[-3:]

'bon'

In [101]:
primera_palabra[:2]

'ja'